# 로그 
import logging
logging.basicConfig(level=logging.INFO)
logger = logging.getLogger(__name__)

# 모듈
from common.querys import Query
from common.utils import import_data


###################################################################################################
# 메인 함수 정의 (실행할 쿼리 함수 선언)
###################################################################################################
def main():
    """ 해당 부분에 사전에 정의한 쿼리 함수들을 설정해서 실행함 """

    # 유저 데이터 추가 
    import_data(path="users.csv", query=Query.users)


















###################################################################################################
# 메인 함수 실행 
###################################################################################################
if __name__ == '__main__':
    main()
